[
    {
        "id" : 1,
        "catagory" : "accordion1",
        "header" : "Do you have backend development knowledge?",
        "body" : "Yes of course! I can build user authentication + Bcrypt-JS security, Complete CRUD operation, & rest API creation using Node-JS, express-JS and MongoDB."
    },
    {
        "catagory" : "accordion2",
        "header" : "How many days of experience do you have?",
        "body" : "I have 1+ years of experience in the web development field."
    },
    {
        "catagory" : "accordion3",
        "header" : "In which technologies & packages are you expert?",
        "body" : "I am an expert in HTML 5, CSS 3, Bootstrap 5.3, Modern Javascript (es-6), and React.js. Also, I am expert in mongoose, bcrypt, Vanilla-tilt, and AOS animation."
    },
    {
        "catagory" : "accordion4",
        "header" : "In which tools do you know to use?",
        "body" : "I use Git & GitHub(to keep my code), Visual Studio Code (as a code editor). Netlify and Vercel (to deploy website)."
    },
    {
        "catagory" : "accordion5",
        "header" : "What is the React? And what is the advantage of React?",
        "body" : "React is an open-source javascript library that was launched in 2011 and it was created by developers at Facebook. React uses Virtual DOM which is very fast and also, it uses re-usable component-based architecture that simplifies the creation of a web application. It deals with complete client-side and server-side data processing and handling."
    },
    {
        "catagory" : "accordion6",
        "header" : "Tell me some hooks & other thing that you can work in React.",
        "body" : "I can work with React router, useState, useEffect, useReducer, useRef, useNavigate, useLocation, context API, React-Icons, React-toastify, React-Slick, Vanilla-tilt, AOS animation and many others."
    },
    {
        "catagory" : "accordion7",
        "header" : "What is the Virtual DOM?",
        "body" : "A virtual DOM is a simple javascript object that is the exact copy of the corresponding real DOM. It can be considered as a node tree that consists of the element, their attributes, and other properties. A virtual DOM update the UI without re-render the entire page and it can't update HTNL directly."
    },
    {
        "catagory" : "accordion8",
        "header" : "What is the different between real DOM and Virtual DOM?",
        "body" : "A virtual DOM update the UI without re-render the entire page and it can't update HTNL directly but the real DOM re-renders the entire page if the UI gets updated and it can change HTML directly."
    }
]